SET QUOTED_IDENTIFIER ON
GO
SET ANSI_NULLS ON
GO
-- RETURN VALUE:
--  0: არ მონაწილეობს ნაღდი ფულის კონტროლში (ასევე NULL)
--  1: დებეტს აკონტროლებს (უმატებს ან აკლებს არსებული ლიმიტის ფარგლებში)
--	2: კრედიტს აკონტროლებს (უმატებს ან აკლებს საბუთის თანხას)
--	3: გადააქვს სალაროს ნაშთი დებეტიდან კრედიტზე არსებული ლიმიტის ფარგლებში

CREATE FUNCTION [dbo].[ops_get_cash_op_type] (@op_code varchar(5), @doc_type smallint)
RETURNS tinyint
AS
BEGIN

	-- დებეტს აკონტროლებს (უმატებს ან აკლებს არსებული ლიმიტის ფარგლებში)
	IF (@doc_type BETWEEN 130 AND 149) OR -- სალაროს გასავალი
		@op_code = '*%TX*' -- სარგებლის დაკავება, როგორც "ნაღდი ფულის ლიმიტის" გაქვითვა
	BEGIN
		RETURN 1
	END
	
	-- კრედიტს აკონტროლებს (უმატებს ან აკლებს საბუთის თანხას)
	IF @doc_type BETWEEN 120 AND 129 OR -- სალაროს შემოსავალი
		@op_code = '*%RL*' OR -- დარიცხული პროცენტის რეალიზაცია, როგორც "ნაღდი ფულის ლიმიტის" დანამატი
		@op_code = '*LP+' OR -- სესხის გაცემა, როგორც "ნაღდი ფულის ლიმიტის" დანამატი
		@op_code = '*DAA*' -- ნაღდი ფულის ლიმიტი გადავიდეს ანაბრის შევსების დროს
		-- ხელფასის დასმა მაგალითისათვის შეიძლება იყოს აქ OP_CODE = 'SLRY'
	BEGIN
		RETURN 2
	END
	
	-- გადააქვს სალაროს ნაშთი დებეტიდან კრედიტზე არსებული ლიმიტის ფარგლებში
	IF @op_code IN ('CASH') OR --
		@op_code = '*DCA*' -- ნაღდი ფულის ლიმიტი გადავიდეს ანაბრის შევსება/რეალიზაციის დროს
	BEGIN
		RETURN 3
	END

	RETURN 0		
END
GO
